In [2]:
import pandas as pd
df = pd.read_csv(r"D:\MY_ML\titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [9]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(4)

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000

In [12]:
#find out any numbers is NAN in any of the columns 
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [13]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(4)

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000

In [30]:
#Use to split our dataset into training and test samples, this is done before training so that our model is not biased
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [31]:
len(X_train)

712

In [32]:
len(X_test)

179

In [33]:
len(inputs)

891

In [34]:
#We will use the bell curve
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [35]:
#Train model
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [36]:
model.score(X_test,y_test)

0.6871508379888268

In [37]:
X_test[:10]

     Pclass        Age      Fare
444       3  29.699118    8.1125
387       2  36.000000   13.0000
861       2  21.000000   11.5000
733       2  23.000000   13.0000
42        3  29.699118    7.8958
581       1  39.000000  110.8833
324       3  29.699118   69.5500
328       3  31.000000   20.5250
708       1  22.000000  151.5500
458       2  50.000000   10.5000

In [38]:
y_test[:10]

444    1
387    1
861    0
733    0
42     0
581    1
324    0
328    1
708    1
458    1
Name: Survived, dtype: int64

model.predict(X_test[:10])

In [39]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 0, 1, 0], dtype=int64)

In [41]:
model.predict_proba(X_test[:10])

array([[0.89054203, 0.10945797],
       [0.78824004, 0.21175996],
       [0.75962828, 0.24037172],
       [0.76765886, 0.23234114],
       [0.89044167, 0.10955833],
       [0.03620002, 0.96379998],
       [0.74642299, 0.25357701],
       [0.89199617, 0.10800383],
       [0.00125457, 0.99874543],
       [0.75806245, 0.24193755]])

In [3]:
from sklearn.naive_bayes import GaussianNB
x=GaussianNB()
x.get_params